/*Първата и третата цифра трябва да бъдат четни.
Втората цифра трябва да бъде просто число в диапазона [2...7].
Горната граница на първото число - цяло число в диапазона [1...9]
Горната граница на второто число - цяло число в диапазона [1...9]
Горната граница на третото число - цяло число в диапазона [1...9]
 */
function uniquePin(num1, num2, num3) {
    
    for(let i = 2; i <= num1; i++) {
        for (let j = 2; j <= num2; j++) {
            for (let k = 2; k <= num3; k++) {
                if (i % 2 === 0 && k % 2 === 0 && [2, 3, 5, 7].includes(j)) {
                    console.log(`${i} ${j} ${k}`);
                }
            }
        }
    }
} 
uniquePin(3,
    5,
    5
    )